Написать программу решающую классическую задачу производитель и потребитель.

Дано два потока — производитель и потребитель.
Два потока разделяют общий буфер данных, размер которого ограничен, например не больше 5 элементов.
Производитель генерирует некоторые данные (можно выбрать любые, числа, символы, строки)
    и помещает их в буфер.
Потребитель «потребляет» их из буфера - выводит на печать в консоль и очищает буфер.
Если буфер пуст, потребитель должен ждать, пока там появятся данные.
Если буфер заполнен полностью, производитель должен ждать, пока потребитель заберёт
    данные и место освободится.
В качестве буфера можно выбрать, например Queue или List, но реализация не должна быть
    потокобезопасная (например LinkedList).




//    public synchronized void toSack_ (List<String> sack, String gift, Person person) {
//        int s = sack.size();
//        if (s < 5) {
//            sack.add(gift);
//            System.out.println(person + " положил " + gift + " в мешок :)");
//        } else {
//            System.out.println("Мешок полон. Нельзя положить подарок :(");
//        }
//    }
//
//    public synchronized void fromSack_ (List<String> sack, Person person) {
//        int s = sack.size();
//        String gift = sack.get(0);
//        if (s > 0) {
//            sack.remove(0);
//            System.out.println(person + " взял " + gift + " из мешка :)");
//        } else {
//            System.out.println("Мешок пустой, нет подарков :(");
//        }
//    }
